package homework03;

/*
Task 1
В классе  HomeWork03 задеклорировать (обьявить) и присвоить  значение 3-м  переменными.
Правельно подберите тип и иммя перемещение

перемещение 1 - сколь вам полніх лет
перемещение 2 - должна хранить стоимость 1 литра молока в вашей стране ( без наймнование валюты - только цена
перемещение 3 - Ваше имя (Опционально, так как мы с вами не учили , в каком типе данных хранить можно хранить текст. (Гугл?))

 */

public class Home03 {
    public static  void  main(String[] args){
        int age = 40;
        double priceMilk = 1.50;
        String name = "Tanya";
    }
}
