package homework08;
/*
Программа запрашивает у пользователя ввод произвольного числа.
 Вывести сумму цифр этого числа.

Пример:

567432 -> 5+6+7+4+3+2 -> 27
 */

import java.util.Scanner;

public class Homework0805 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите произвольное число : ");
        String input = scanner.nextLine();
        int sum = 0;
    }

}
